sascha432/esp8266-kfc-fw/lib/KFCBaseLibrary/include/Arduino_compat.h
/**
 * Author: sascha_lammers@gmx.de
 */

/**
 * Quick and dirty library to compile ESP8266 and ESP32 code with MSVC++ as native Win32 Console Application
 */

#pragma once

#if _DEBUG && _MSC_VER
#define _debug_new new ( _NORMAL_BLOCK , __FILE__ , __LINE__ )
// Replace _NORMAL_BLOCK with _CLIENT_BLOCK if you want the
// allocations to be of _CLIENT_BLOCK type
#else
#define _debug_new new
#endif

#if defined(ESP32)

#include <Arduino.h>
#include <global.h>
#include <SPIFFS.h>
#include <WiFi.h>
#include <FS.h>

#include "esp32_compat.h"

#define PROGMEM_STRING_DECL(name)               extern const char _shared_progmem_string_##name[] PROGMEM;
#define PROGMEM_STRING_DEF(name, value)         const char _shared_progmem_string_##name[] PROGMEM = { value };

class __FlashStringHelper;

#define SPGM(name)                              _shared_progmem_string_##name
#define FSPGM(name)                             reinterpret_cast<const __FlashStringHelper *>(SPGM(name))
#define PSPGM(name)                             (PGM_P)(SPGM(name))

#define constexpr_strlen                        strlen
#define constexpr_strlen_P                      strlen_P

#include "debug_helper.h"
#include "misc.h"

#elif defined(ESP8266)

#include <Arduino.h>
#include <global.h>
#include <ESP8266WiFi.h>
#include <ESP8266WiFiType.h>
#include <WiFiUdp.h>
#include <FS.h>

#include "esp8266_compat.h"

#define PROGMEM_STRING_DECL(name)               extern const char _shared_progmem_string_##name[] PROGMEM;
#define PROGMEM_STRING_DEF(name, value)         const char _shared_progmem_string_##name[] PROGMEM = { value };

#define SPGM(name)                              _shared_progmem_string_##name
#define FSPGM(name)                             FPSTR(SPGM(name))
#define PSPGM(name)                             (PGM_P)(SPGM(name))

#define constexpr_strlen                        strlen
#define constexpr_strlen_P                      strlen_P

#include "debug_helper.h"
#include "misc.h"

#elif _WIN32 || _WIN64

#define NOMINMAX
#define _CRTDBG_MAP_ALLOC

#include <stdint.h>
#include <stdlib.h>
#include <crtdbg.h>
#include <string.h>
#include <time.h>
#include <winsock.h>
#include <strsafe.h>
#include <vector>
#include <iostream>
#include <Psapi.h>

#ifndef DEBUG_OUTPUT
#define DEBUG_OUTPUT Serial
#endif
#include <global.h>

void panic();

#define PROGMEM_STRING_DECL(name)               extern const char * const _shared_progmem_string_##name;
#define PROGMEM_STRING_DEF(name, value)         const char * const _shared_progmem_string_##name = value;

#define PROGMEM

#define SPGM(name)                              _shared_progmem_string_##name
#define FSPGM(name)                             FPSTR(SPGM(name))
#define PSPGM(name)                             (PGM_P)(SPGM(name))

//#define F(str) (reinterpret_cast<char *>(str))
#define PSTR(str) str
#define FPSTR(str) str
#define snprintf_P snprintf
#define sprintf_P sprintf
#define strstr_P strstr
#define strlen_P strlen
#define pgm_read_byte(a)                        (*a)
#define pgm_read_word(addr)                     (*reinterpret_cast<const uint16_t*>(addr))
#define pgm_read_dword(addr) 		            (*reinterpret_cast<const uint32_t*>(addr))
#define pgm_read_ptr(addr)                      (*reinterpret_cast<const void* const *>(addr))
#define memcmp_P memcmp
#define strcpy_P strcpy
#define strncpy_P strncpy
#define memcpy_P memcpy

int constexpr constexpr_strlen(const char* str) {
    return *str ? 1 + constexpr_strlen(str + 1) : 0;
}

#define constexpr_strlen_P constexpr_strlen

#ifndef PGM_P
typedef const char *PGM_P;
#endif
class __FlashStringHelper;

#define __FPSTR(pstr_pointer) (reinterpret_cast<const __FlashStringHelper *>(pstr_pointer))
#define __PSTR(s) ((const char *)s)
#define F(string_literal) (__FPSTR(__PSTR(string_literal)))

#define strcasecmp_P _stricmp
#define strncasecmp _strnicmp
#define strcmp_P strcmp

#ifndef strdup
#define strdup _strdup
#endif
void throwException(PGM_P message);

unsigned long millis();

void delay(uint32_t time_ms);
void yield();

class Print;

class Printable {
   public:
    virtual size_t printTo(Print &p) const = 0;
};

#define DEC 10
#define HEX 16
#define OCT 8
#define BIN 2

class String;

class Print {
   private:
    int write_error;
    size_t printNumber(unsigned long, uint8_t);
    size_t printFloat(double, uint8_t);

   protected:
    void setWriteError(int err = 1) {
        write_error = err;
    }

   public:
    Print() : write_error(0) {
    }

    int getWriteError() {
        return write_error;
    }
    void clearWriteError() {
        setWriteError(0);
    }

    virtual size_t write(uint8_t) = 0;
    size_t write(const char *str) {
        if (str == NULL) return 0;
        return write((const uint8_t *)str, strlen(str));
    }
    virtual size_t write(const uint8_t *buffer, size_t size);
    size_t write(const char *buffer, size_t size) {
        return write((const uint8_t *)buffer, size);
    }

    size_t printf(const char *format, ...);
    size_t printf_P(PGM_P format, ...);
    size_t print(const __FlashStringHelper *);
    size_t print(const String &);
    size_t print(const char[]);
    size_t print(char);
    size_t print(unsigned char, int = DEC);
    size_t print(int, int = DEC);
    size_t print(unsigned int, int = DEC);
    size_t print(long, int = DEC);
    size_t print(unsigned long, int = DEC);
    size_t print(double, int = 2);
    size_t print(const Printable &);

    size_t println(const __FlashStringHelper *);
    size_t println(const String &s);
    size_t println(const char[]);
    size_t println(char);
    size_t println(unsigned char, int = DEC);
    size_t println(int, int = DEC);
    size_t println(unsigned int, int = DEC);
    size_t println(long, int = DEC);
    size_t println(unsigned long, int = DEC);
    size_t println(double, int = 2);
    size_t println(const Printable &);
    size_t println(void);

    virtual void flush() { /* Empty implementation for backward compatibility */
    }
};

