sascha432/esp8266-kfc-fw/lib/KFCBaseLibrary/include/Arduino_compat.h
enum SeekMode { SeekSet = SEEK_SET, SeekCur = SEEK_CUR, SeekEnd = SEEK_END };

class Stream : public Print {
   public:
    Stream() : Print() {
        _fp = nullptr;
    }
    Stream(FILE *fp) : _fp(fp) {
        if (fp) {
            seek(0, SeekEnd);
            _size = position();
            seek(0);
        }
    }
    //virtual ~Stream() {
    //	if (_fp) {
 //           fclose(_fp);
    //	}
    //}

    FILE *getFile() {
        return _fp;
    }
    void setFile(FILE *fp) {
        _fp = fp;
        seek(0, SeekEnd);
        _size = position();
        seek(0);
    }

    virtual size_t position() const {
        return ftell(_fp);
    }

    virtual bool seek(long pos, int mode) {
        int res = fseek(_fp, pos, mode);
        if (res != 0) {
            perror("seek");
        }
        // printf("DEBUG seek %d %d = %d => %d\n", pos, mode, res, res == 0);
        return res == 0;
        // return fseek(_fp, pos, mode) == 0;
    }
    bool seek(long pos) {
        return seek(pos, SeekSet);
    }

    virtual size_t size() const {
        return _size;
    }

    virtual operator bool() const {
        return _fp != nullptr;
    }

    virtual int read() {
        if (!_fp) {
            return -1;
        }
        uint8_t b;
        if (read(&b, sizeof(b)) != 1) {
            if (ferror(_fp)) {
                perror("read");
            }
            printf("DEBUG read -1\n");
            return -1;
        }
        // printf("DEBUG read byte\n");
        return b;
    }

    virtual int peek() {
        long pos = ftell(_fp);
        int res = read();
        fseek(_fp, pos, SEEK_SET);
        return res;
    }

    int read(uint8_t *buffer, size_t len) {
        uint8_t *ptr = buffer;
        while (len--) {
            int ch = read();
            if (ch == -1) {
                break;
            }
            *ptr++ = ch;
        }
        return ptr - buffer;
    }

    String readStringUntil(char terminator) {
        int ch;
        String buf;
        while (true) {
            if (!available() || (ch = read()) == -1) {
                printf("readStringUntil(%d) failed\n", terminator);
                break;
            }
            if (ch == terminator) {
                break;
            }
            if (buf.length() > 1024) {
                printf("readStringUntil(%d) failed, reached 1024byte length\n", terminator);
                return String();
            }
            buf += (char)ch;
        }
        return buf;
    }

    String readString() {
        String buf;
        while (available()) {
            int ch = read();
            if (ch == -1) {
                break;
            }
            buf += (char)ch;
        }
        return buf;
    }

    virtual size_t readBytes(char *buffer, size_t length) {
        return read((uint8_t *)buffer, length);
    }
    virtual size_t readBytes(uint8_t *buffer, size_t length) {
        return readBytes((char *)buffer, length);
    }

    size_t write(char data) {
        return write((uint8_t)data);
    }
    size_t write(uint8_t data) {
        return write(&data, sizeof(data));
    }
    virtual size_t write(const uint8_t *data, size_t len) {
        size_t size = fwrite(data, 1, len, _fp);
        if (ferror(_fp)) {
            perror("write");
        }
        return size;
    }

    virtual void close() {
        if (_fp) {
            fclose(_fp);
        }
    }

    virtual void flush() {
        fflush(_fp);
    }

    virtual int available() {
        return feof(_fp) ? 0 : 1;
    }

   private:
    FILE *_fp;
    size_t _size;
};

class File : public Stream {
   public:
    File() : Stream() {
    }
    File(FILE *fp) : Stream(fp) {
    }
};

class Dir {
public:

    static void __test();

    Dir(const String directory) : _handle(INVALID_HANDLE_VALUE) {
        _directory = directory;
        _directory.replace('/', '\\');
        if (!_directory.endsWith("\\")) {
            _directory += '\\';
        }
    }
    ~Dir() {
        if (_handle != INVALID_HANDLE_VALUE) {
            FindClose(_handle);
            _handle = INVALID_HANDLE_VALUE;
        }
    }

    bool next() {
        bool result;
        if (_handle == INVALID_HANDLE_VALUE) {
            TCHAR path[MAX_PATH];
            size_t convertedChars = 0;
            mbstowcs_s(&convertedChars, path, MAX_PATH, _directory.c_str(), _TRUNCATE);
            StringCchCat(path, MAX_PATH, TEXT("*"));
            if ((_handle = FindFirstFile(path, &_ffd)) == INVALID_HANDLE_VALUE) {
                return false;
            }
            result = true;
        } else {
            result = FindNextFile(_handle, &_ffd);
        }
        return result;
    }

    bool isDirectory() const {
        return (_handle != INVALID_HANDLE_VALUE) && (_ffd.dwFileAttributes & FILE_ATTRIBUTE_DIRECTORY);
    }

    bool isFile() const {
        return (_handle != INVALID_HANDLE_VALUE) && !(_ffd.dwFileAttributes & FILE_ATTRIBUTE_DIRECTORY);
    }

    const String fileName() const {
        String tmp;
        tmp.reserve(wcslen(_ffd.cFileName) + 1);
        size_t convertedChars;
        wcstombs_s(&convertedChars, tmp.begin(), tmp.capacity(), _ffd.cFileName, _TRUNCATE);
        tmp.replace('\\', '/');
        return tmp;
    }

    uint32_t fileSize() const {
        if (isFile()) {
            return _ffd.nFileSizeLow;
        }
        return 0;
    }

    File openFile(const char *mode);

private:
    HANDLE _handle;
    WIN32_FIND_DATA _ffd;
    String _directory;
};


class _SPIFFS {
   public:
    File open(const String filename, const char *mode) {
        FILE *fp;
        fopen_s(&fp, filename.c_str(), mode);
        return File(fp);
    }

    Dir openDir(const String dir) {
        return Dir(dir);
    }

    bool exists(const String filename) {
        File file = open(filename, "r");
        bool result = !!file;
        file.close();
        return result;
    }

    bool remove(const String filename) {
        return ::remove(filename.c_str()) == 0;
    }

    bool rename(const String fromPath, const String toPath) {
        return ::rename(fromPath.c_str(), toPath.c_str()) == 0;
    }
};

