sascha432/esp8266-kfc-fw/lib/KFCBaseLibrary/include/Arduino_compat.h
class IPAddress {
   public:
    struct _address {
        uint8_t byte[4];
    };

    IPAddress() {
        _addr = 0;
    }
    IPAddress(uint32_t addr) {
        _addr = addr;
    }
    IPAddress(const String &addr) {
        fromString(addr);
    }
    IPAddress(uint8_t a, uint8_t b, uint8_t c, uint8_t d) {
        ((_address *)&_addr)->byte[0] = a;
        ((_address *)&_addr)->byte[1] = b;
        ((_address *)&_addr)->byte[2] = c;
        ((_address *)&_addr)->byte[3] = d;
    }

    operator uint32_t() const {
        return *(uint32_t *)&_addr;
    }

    IPAddress &operator=(uint32_t addr) {
        _addr = addr;
        return *this;
    }
    bool operator==(const IPAddress &addr) {
        return _addr = addr._addr;
    }

    bool fromString(const String &addr) {
        _addr = inet_addr(addr.c_str());
        return _addr != 0;
    }
    String toString() const {
        in_addr a;
        a.S_un.S_addr = _addr;
        return inet_ntoa(a);
    }

    uint8_t *raw_address() const {
        return (uint8_t *)&_addr;
    }

   private:
    uint32_t _addr;
};

class EEPROMFile : public Stream {
   public:
    EEPROMFile(uint16_t size = 4096) {
        _position = 0;
        _size = size;
        _eeprom = nullptr;
    }
    ~EEPROMFile() {
        close();
    }

    void clear() {
        begin();
        memset(_eeprom, 0, _size);
        commit();
    }

    size_t length() const {
        return _size;
    }

    uint8_t *getDataPtr() const {
        return _eeprom;
    }

    uint8_t *getConstDataPtr() const {
        return _eeprom;
    }

    uint8_t& operator[](int const address) {
        return _eeprom[address];
    }

    uint8_t const & operator[](int const address) const {
        return _eeprom[address];
    }

    uint8_t read(int const address) {
        return _eeprom[address];
    }

    void write(int const address, uint8_t const val) {
        _eeprom[address] = val;
    }

    template<typename T>
    T &get(int const address, T &t) {
        if (address < 0 || address + sizeof(T) > _size)
            return t;

        memcpy((uint8_t*) &t, _eeprom + address, sizeof(T));
        return t;
    }

    template<typename T>
    const T &put(int const address, const T &t) {
        if (address < 0 || address + sizeof(T) > _size) {
            return t;
        }
        memcpy(_eeprom + address, (const uint8_t*)&t, sizeof(T));
        return t;
    }

    bool begin(int size = -1) {
        if (_eeprom) {
            free(_eeprom);
        }
        _eeprom = (uint8_t *)malloc(_size);
        if (!_eeprom) {
            return false;
        }
        FILE *fp;
        errno_t err = fopen_s(&fp, "eeprom.bin", "rb");
        if (err) {
            memset(_eeprom, 0, _size);
            if (commit()) {
                return true;
            }
            return false;
        }
        if (fread(_eeprom, _size, 1, fp) != 1) {
            perror("read");
            fclose(fp);
            return false;
        }
        fclose(fp);
        return true;
    }

    void end() {
        if (_eeprom) {
            commit();
            //free(_eeprom);
            //_eeprom = nullptr;
        }
    }

    bool commit() {
        FILE *fp;
        errno_t err = fopen_s(&fp, "eeprom.bin", "wb");
        if (err) {
            return false;
        }
        if (fwrite(_eeprom, _size, 1, fp) != 1) {
            perror("write");
            return false;
        }
        fclose(fp);
        return true;
    }

    void close() {
        end();
    }

    size_t position() {
        return _position;
    }

    bool seek(long pos, int mode) override {
        if (mode == SeekSet) {
            if (pos >= 0 && pos < _size) {
                _position = (uint16_t)pos;
                return true;
            }
        } else if (mode == SeekCur) {
            return seek(_position + pos, SeekSet);
        } else if (mode == SeekEnd) {
            return seek(_size - pos, SeekSet);
        }
        return false;
    }
    bool seek(long pos) {
        return seek(pos, SeekSet);
    }

    int read() override {
        uint8_t ch;
        if (read(&ch, sizeof(ch)) != 1) {
            return -1;
        }
        return ch;
    }
    int read(uint8_t *buffer, size_t len) {
        if (_position + len >= _size) {
            len = _size - _position;
        }
        memcpy(buffer, _eeprom + _position, len);
        _position += (uint16_t)len;
        return len;
    }


    size_t write(char data) {
        return write((uint8_t)data);
    }
    size_t write(uint8_t data) {
        return write(&data, sizeof(data));
    }
    size_t write(uint8_t *data, size_t len) {
        if (_position + len >= _size) {
            len = _size - _position;
        }
        memcpy(_eeprom + _position, data, len);
        _position += (uint16_t)len;
        return len;
    }

    void flush() {
    }

    size_t size() const override {
        return _size;
    }

    int available() override {
        return _size - _position;
    }

private:
    FILE *fp;
    uint8_t *_eeprom;
    uint16_t _position;
    uint16_t _size;
};

extern _SPIFFS SPIFFS;

class Stdout : public Stream {
   public:
    Stdout() : Stream() {
        _size = 0xffff;
        _position = 0;
        _buffer = (uint8_t *)calloc(_size, 1);
    }
    ~Stdout() {
        close();
    }

    void close() {
        free(_buffer);
        _buffer = nullptr;
    }

    size_t position() const override {
        return _position;
    }

    bool seek(long pos, int mode) {
        if (mode == SeekSet) {
            if (pos >= 0 && pos < _size) {
                _position = (uint16_t)pos;
                return true;
            }
        } else if (mode == SeekCur) {
            return seek(_position + pos, SeekSet);
        } else if (mode == SeekEnd) {
            return seek(_size - pos, SeekSet);
        }
        return false;
    }
    bool seek(long pos) {
        return seek(pos, SeekSet);
    }

    int read() {
        uint8_t ch;
        if (read(&ch, sizeof(ch)) != 1) {
            return -1;
        }
        return ch;
    }
    int read(uint8_t *buffer, size_t len) {
        if (_position + len >= _size) {
            len = _size - _position;
        }
        memcpy(buffer, _buffer + _position, len);
        return len;
    }


    size_t write(char data) {
        return write((uint8_t)data);
    }
    size_t write(uint8_t data) {
        return write(&data, sizeof(data));
    }
    size_t write(const uint8_t *data, size_t len) override {
        if (_position + len >= _size) {
            len = _size - _position;
        }
        ::printf("%04x-%04x: ", _position, _position + len - 1);
        for (size_t i = 0; i < len; i++) {
            ::printf("%02x ", data[i]);
        }
        for (size_t i = 0; i < len; i++) {
            if (isalnum(data[i])) {
                ::printf("%c", data[i]);
            } else {
                ::printf(".");
            }
        }
        ::printf("\n");
        memcpy(_buffer + _position, data, len);
        _position += (uint16_t)len;
        return len;
    }

    void flush() {
    }

    size_t size() const {
        return _size;
    }

    int available() override {
        return _size - _position;
    }


