sascha432/esp8266-kfc-fw/lib/KFCBaseLibrary/include/Arduino_compat.h
   private:
    uint8_t *_buffer;
    uint16_t _position;
    uint16_t _size;
};

class FakeSerial : public Stdout {
   public:
    FakeSerial() : Stdout() {
    }
    void begin(int baud) {
    }
    void end() {
    }
    virtual int available() {
        return 0;
    }
    virtual int read() {
        return -1;
    }
    virtual int peek() {
        return -1;
    }
    void flush(void) override {
        fflush(stdout);
    }
    virtual size_t write(uint8_t c) override {
        ::printf("%c", c);
        return 1;
    }
    virtual size_t write(const uint8_t *data, size_t len) override {
        auto ptr = (const char *)data;
        auto pos = len;
        while(pos--) {
            ::printf("%c", *ptr++);
        }
        return len;
    }
};

extern FakeSerial Serial;

#pragma comment(lib, "Ws2_32.lib")

class WiFiUDP : public Stream {
   public:
    WiFiUDP();
    ~WiFiUDP();

    int beginPacket(const char *host, uint16_t port);
    int beginPacket(IPAddress ip, uint16_t port);
    size_t write(uint8_t byte);
    size_t write(const uint8_t *buffer, size_t size);
    void flush();
    int endPacket();

   private:
    int _beginPacket(uint16_t port);
    void _clear();

    int available() override {
        return 0;
    }
    int read() override {
        return -1;
    }
    int peek() override {
        return -1;
    }


   private:
    SOCKET _socket;
    sockaddr_in _dst;
    char *_buffer;
    uint16_t _len;
};

class ESP8266WiFiClass {
   public:
    ESP8266WiFiClass() {
        _isConnected = true;
    }

    bool isConnected() {
        return _isConnected;
    }
    void setIsConnected(bool connected) {
        _isConnected = connected;
    }

   private:
    bool _isConnected;
};

class StringStream : public Stream {
public:
    StringStream(String &string);
    virtual ~StringStream();

    virtual int available() override;
    virtual int read() override;
    virtual int peek() override;
    virtual size_t write(uint8_t data);

private:
    uint16_t _position;
    String &_string;
};

class BufferStream;

class HTTPClient {
public:
    HTTPClient();
    virtual ~HTTPClient();

    void begin(String url);
    void end();

    int GET();
    size_t getSize();
    Stream &getStream();

private:
    void _close();

    SOCKET _socket;
    String _url;
    String _host;
    uint16_t _port;
    String _path;
    BufferStream *_body;
    int _httpCode;
};

struct rst_info{
    uint32_t reason;
    uint32_t exccause;
    uint32_t epc1;
    uint32_t epc2;
    uint32_t epc3;
    uint32_t excvaddr;
    uint32_t depc;
};

enum WiFiDisconnectReason
{
    WIFI_DISCONNECT_REASON_UNSPECIFIED              = 1,
    WIFI_DISCONNECT_REASON_AUTH_EXPIRE              = 2,
    WIFI_DISCONNECT_REASON_AUTH_LEAVE               = 3,
    WIFI_DISCONNECT_REASON_ASSOC_EXPIRE             = 4,
    WIFI_DISCONNECT_REASON_ASSOC_TOOMANY            = 5,
    WIFI_DISCONNECT_REASON_NOT_AUTHED               = 6,
    WIFI_DISCONNECT_REASON_NOT_ASSOCED              = 7,
    WIFI_DISCONNECT_REASON_ASSOC_LEAVE              = 8,
    WIFI_DISCONNECT_REASON_ASSOC_NOT_AUTHED         = 9,
    WIFI_DISCONNECT_REASON_DISASSOC_PWRCAP_BAD      = 10,  /* 11h */
    WIFI_DISCONNECT_REASON_DISASSOC_SUPCHAN_BAD     = 11,  /* 11h */
    WIFI_DISCONNECT_REASON_IE_INVALID               = 13,  /* 11i */
    WIFI_DISCONNECT_REASON_MIC_FAILURE              = 14,  /* 11i */
    WIFI_DISCONNECT_REASON_4WAY_HANDSHAKE_TIMEOUT   = 15,  /* 11i */
    WIFI_DISCONNECT_REASON_GROUP_KEY_UPDATE_TIMEOUT = 16,  /* 11i */
    WIFI_DISCONNECT_REASON_IE_IN_4WAY_DIFFERS       = 17,  /* 11i */
    WIFI_DISCONNECT_REASON_GROUP_CIPHER_INVALID     = 18,  /* 11i */
    WIFI_DISCONNECT_REASON_PAIRWISE_CIPHER_INVALID  = 19,  /* 11i */
    WIFI_DISCONNECT_REASON_AKMP_INVALID             = 20,  /* 11i */
    WIFI_DISCONNECT_REASON_UNSUPP_RSN_IE_VERSION    = 21,  /* 11i */
    WIFI_DISCONNECT_REASON_INVALID_RSN_IE_CAP       = 22,  /* 11i */
    WIFI_DISCONNECT_REASON_802_1X_AUTH_FAILED       = 23,  /* 11i */
    WIFI_DISCONNECT_REASON_CIPHER_SUITE_REJECTED    = 24,  /* 11i */

    WIFI_DISCONNECT_REASON_BEACON_TIMEOUT           = 200,
    WIFI_DISCONNECT_REASON_NO_AP_FOUND              = 201,
    WIFI_DISCONNECT_REASON_AUTH_FAIL                = 202,
    WIFI_DISCONNECT_REASON_ASSOC_FAIL               = 203,
    WIFI_DISCONNECT_REASON_HANDSHAKE_TIMEOUT        = 204,
};

enum rst_reason {
    REASON_DEFAULT_RST      = 0,    /* normal startup by power on */
    REASON_WDT_RST          = 1,    /* hardware watch dog reset */
    REASON_EXCEPTION_RST    = 2,    /* exception reset, GPIO status won�t change */
    REASON_SOFT_WDT_RST     = 3,    /* software watch dog reset, GPIO status won�t change */
    REASON_SOFT_RESTART     = 4,    /* software restart ,system_restart , GPIO status won�t change */
    REASON_DEEP_SLEEP_AWAKE = 5,    /* wake up from deep-sleep */
    REASON_EXT_SYS_RST      = 6     /* external system reset */
};

enum RFMode {
    RF_DEFAULT = 0, // RF_CAL or not after deep-sleep wake up, depends on init data byte 108.
    RF_CAL = 1,      // RF_CAL after deep-sleep wake up, there will be large current.
    RF_NO_CAL = 2,   // no RF_CAL after deep-sleep wake up, there will only be small current.
    RF_DISABLED = 4 // disable RF after deep-sleep wake up, just like modem sleep, there will be the smallest current.
};

class EspClass {
public:
    EspClass() {
        memset(&resetInfo, 0, sizeof(resetInfo));
        _rtcMemory = nullptr;
        _readRtcMemory();
    }
    ~EspClass() {
        free(_rtcMemory);
    }

    bool rtcUserMemoryRead(uint32_t offset, uint32_t *data, size_t size)  {
        offset = (offset * rtcMemoryBlkSize) + rtcMemoryReserved;
        if (size + offset > rtcMemorySize) {
            return false;
        } else {
            memcpy(data, _rtcMemory + offset, size);
            return true;
        }
    }

    bool rtcUserMemoryWrite(uint32_t offset, uint32_t *data, size_t size)    {
        offset = (offset * rtcMemoryBlkSize) + rtcMemoryReserved;
        if (size + offset > rtcMemorySize) {
            return false;
        } else {
            memcpy(_rtcMemory + offset, data, size);
            _writeRtcMemory();
            return true;
        }
    }

    int getFreeHeap() {
        PROCESS_MEMORY_COUNTERS pmc;
        GetProcessMemoryInfo(GetCurrentProcess(), &pmc, sizeof(pmc));
        return pmc.WorkingSetSize;
    }

    void rtcMemDump();
    void rtcClear();

    String getResetReason(void) {
        return "Unknown";
    }

    String getResetInfo(void) {
        return "Info 0";
    }

    struct rst_info *getResetInfoPtr(void) {
        return &resetInfo;
    }

#if _DEBUG && _MSC_VER // MSVC memory debug
    void _enableMSVCMemdebug() {
        // Get current flag
        int tmpFlag = _CrtSetDbgFlag( _CRTDBG_REPORT_FLAG );

        // Turn on leak-checking bit.
        tmpFlag |= _CRTDBG_LEAK_CHECK_DF|_CRTDBG_ALLOC_MEM_DF|_CRTDBG_DELAY_FREE_MEM_DF|_CRTDBG_CHECK_ALWAYS_DF|_CRTDBG_CHECK_CRT_DF|_CRTDBG_LEAK_CHECK_DF;

        // Turn off CRT block checking bit.
        tmpFlag &= ~_CRTDBG_CHECK_CRT_DF;

        // Set flag to the new value.
        _CrtSetDbgFlag(tmpFlag);
    }
#endif


