sascha432/esp8266-kfc-fw/lib/KFCBaseLibrary/include/Arduino_compat.h
private:
    void _readRtcMemory() {
        if (_rtcMemory) {
            free(_rtcMemory);
        }
        _rtcMemory = (uint8_t *)calloc(rtcMemorySize, 1);
        FILE *fp = fopen("rtcmemory.bin", "rb");
        if (fp) {
            fread(_rtcMemory, 1, rtcMemorySize, fp);
            fclose(fp);
        }
    }
    void _writeRtcMemory() {
        if (!_rtcMemory) {
            return;
        }
        FILE *fp = fopen("rtcmemory.bin", "wb");
        if (fp) {
            fwrite(_rtcMemory, 1, rtcMemorySize, fp);
            fclose(fp);
        }
    }

    static const uint16_t rtcMemoryReserved = 256;
    static const uint16_t rtcMemoryUser = 512;
    static const uint16_t rtcMemorySize = rtcMemoryReserved + rtcMemoryUser;
    static const uint8_t rtcMemoryBlkSize = 4;
public:
    uint8_t *_rtcMemory;

    struct rst_info resetInfo;
};

extern ESP8266WiFiClass WiFi;
extern EEPROMFile EEPROM;
extern EspClass ESP;

struct os_timer_t;

class ESPTimerThread {
public:
    typedef std::vector<os_timer_t *> TimerVector;

    ESPTimerThread() {
        _handle = nullptr;
    }
    virtual ~ESPTimerThread() {
        end();
    }

    void begin();
    void end();
    TimerVector &getVector();
    void run();

private:
    void _removeEndedTimers();

    HANDLE _handle;
    TimerVector _timers;
};

extern ESPTimerThread timerThread;


typedef void os_timer_func_t(void *timer_arg);

struct os_timer_t {
    int _interval;
    int _repeat;
    os_timer_func_t *_func;
    void *_arg;
    unsigned long _nextCall;
};

void os_timer_setfn(os_timer_t *timer, os_timer_func_t func, void *arg);
void os_timer_arm(os_timer_t *timer, int interval, int repeat);
void os_timer_disarm(os_timer_t *timer);

#include "debug_helper.h"
#include "debug_helper_enable.h"
#include "misc.h"

#else

#error Platform not supported

#endif

#ifndef _STRINGIFY
#define _STRINGIFY(s)                   __STRINGIFY(s)
#endif
#ifndef __STRINGIFY
#define __STRINGIFY(s)                  #s
#endif
